# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

a= [1,2,2,4,4,6,2,2,3,1,4,8,7,5,5,5,1]

print(set(a))